exploded/ESP32-Rolloff/src/main.cpp
// ── HTTP instrumentation ──────────────────────────────────────────────────────
#define HEARTBEAT_MS       (30UL * 1000UL)        // serial status line
#define REQ_WINDOW_MS      (60UL * 1000UL)        // rolling request-rate window
#define NET_STALL_MS       (10UL * 60UL * 1000UL) // log-only: no requests at all

// ── Time (house convention: Melbourne, DST handled by configTzTime) ───────────
static const char *TZ_INFO      = "AEST-10AEDT,M10.1.0/2,M4.1.0/3";
static const char *NTP_SERVER_1 = "pool.ntp.org";
static const char *NTP_SERVER_2 = "time.nist.gov";
#define TIME_SYNCED_EPOCH  1704067200UL   // 2024-01-01; anything below = not synced

// ── Ports ─────────────────────────────────────────────────────────────────────
#define INFO_PORT              80
#define ALPACA_HTTP_PORT    11111
#define ALPACA_DISCOVERY_PORT 32227

// ── Globals ───────────────────────────────────────────────────────────────────
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

// WiFiServer::begin() returns void and fails silently: on a failed socket/bind/
// listen it leaves _listening false and available() then returns nothing for
// ever, leaving the device pingable but permanently unable to serve.  WebServer
// keeps its WiFiServer protected, so expose its liveness rather than guess.
class GuardedWebServer : public WebServer {
public:
    using WebServer::WebServer;
    bool isListening() { return (bool)_server; }
};

GuardedWebServer infoServer(INFO_PORT);
GuardedWebServer alpacaServer(ALPACA_HTTP_PORT);
AsyncUDP         udpDiscovery;

void startDiscovery();   // defined below; re-armed by the WiFi supervisor

bool s_oledOk = false;

// ── State ─────────────────────────────────────────────────────────────────────
enum ShutterStatus {
    SHUTTER_OPEN    = 0,
    SHUTTER_CLOSED  = 1,
    SHUTTER_OPENING = 2,
    SHUTTER_CLOSING = 3,
    SHUTTER_ERROR   = 4
};
enum MotionState { MOTION_NONE = 0, MOTION_OPENING, MOTION_CLOSING, MOTION_ERROR };
enum LastCommand  { LAST_CMD_NONE = 0, LAST_CMD_OPEN, LAST_CMD_CLOSE };

MotionState   s_motionState     = MOTION_NONE;
unsigned long s_motionStartMs   = 0;
LastCommand   s_lastCommand     = LAST_CMD_NONE;
bool          s_alpacaConnected = true;
uint32_t      s_serverTxId      = 1;

bool          s_relayActive   = false;
unsigned long s_relayStartMs  = 0;
unsigned long s_lastOledMs    = 0;

// WiFi supervisor state
unsigned long s_lastWifiCheckMs = 0;
unsigned long s_wifiDownSinceMs = 0;   // 0 = link is up
uint8_t       s_wifiRetries     = 0;
uint32_t      s_wifiDropCount   = 0;   // reported on the info page

// Set from the WiFi event task, consumed in loop().  The handler must stay this
// trivial: WiFi.begin()/disconnect() must not be called from the event context,
// so all it does is raise a flag that forces the next poll to run immediately.
volatile bool    s_wifiEvtDisconnected = false;
volatile bool    s_wifiEvtGotIp        = false;
volatile uint8_t s_wifiDisconnectReason = 0;

void onWiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info)
{
    switch (event) {
        case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
            s_wifiDisconnectReason = info.wifi_sta_disconnected.reason;
            s_wifiEvtDisconnected  = true;
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP:
            s_wifiEvtGotIp = true;
            break;
        default:
            break;
    }
}

// ── Diagnostics ───────────────────────────────────────────────────────────────
// Lives in RTC memory, which survives a software reset and a watchdog reset but
// not a power cycle.  That's exactly what we want: if the device reboots itself
// overnight the evidence is still there in the morning.  A power cycle
// deliberately clears it, so the counters always mean "since mains was applied".
// Bump the magic whenever the layout below changes, otherwise a reflash can find
// stale RTC contents that still match the old magic and decode as garbage.
#define DIAG_MAGIC   0x524F4C47UL   // "ROLG" — rev 2, DiagEntry gained `detail`
#define DIAG_EVENTS  12

// Appended to only — existing values must keep their numbers so an RTC record
// written by an older build still decodes.  Adding a name does not change
// DiagEntry's layout, so DIAG_MAGIC does not need bumping for this.
enum DiagEvent : uint8_t {
    EV_NONE = 0, EV_BOOT, EV_WIFI_LOST, EV_WIFI_OK, EV_REBOOT, EV_OPEN, EV_CLOSE,
    EV_ABORT, EV_NET_STALL
};

struct DiagEntry {
    uint32_t epoch;      // 0 if the clock wasn't synced yet
    uint32_t uptimeSec;
    uint8_t  type;
    uint8_t  detail;     // EV_WIFI_LOST: the 802.11 disconnect reason code
};

struct DiagRecord {
    uint32_t  magic;
    uint32_t  bootCount;
    uint32_t  wifiDrops;   // cumulative across reboots, unlike s_wifiDropCount
    uint8_t   head;
    DiagEntry ev[DIAG_EVENTS];
};

RTC_NOINIT_ATTR DiagRecord s_diag;

const char *diagEventName(uint8_t t)
{
    switch (t) {
        case EV_BOOT:      return "boot";
        case EV_WIFI_LOST: return "WiFi lost";
        case EV_WIFI_OK:   return "WiFi recovered";
        case EV_REBOOT:    return "self-reboot";
        case EV_OPEN:      return "open cmd";
        case EV_CLOSE:     return "close cmd";
        case EV_ABORT:     return "abort cmd";
        case EV_NET_STALL: return "no requests";
        default:           return "";
    }
}

const char *resetReasonName()
{
    switch (esp_reset_reason()) {
        case ESP_RST_POWERON:  return "power-on";
        case ESP_RST_SW:       return "software restart";
        case ESP_RST_PANIC:    return "panic / exception";
        case ESP_RST_TASK_WDT: return "TASK WATCHDOG";
        case ESP_RST_INT_WDT:  return "interrupt watchdog";
        case ESP_RST_WDT:      return "other watchdog";
        case ESP_RST_BROWNOUT: return "BROWNOUT (power dip)";
        case ESP_RST_EXT:      return "external reset pin";
        case ESP_RST_DEEPSLEEP:return "deep sleep wake";
        default:               return "unknown";
    }
}

void diagLog(DiagEvent type, uint8_t detail = 0)
{
    DiagEntry &e = s_diag.ev[s_diag.head];
    time_t now   = time(nullptr);
    e.epoch      = (now > (time_t)TIME_SYNCED_EPOCH) ? (uint32_t)now : 0;
    e.uptimeSec  = millis() / 1000UL;
    e.type       = (uint8_t)type;
    e.detail     = detail;
    s_diag.head  = (s_diag.head + 1) % DIAG_EVENTS;
}

// The common 802.11 reason codes, so the log reads without a lookup table.
// 15 in particular means the AP's group-key rotation timed out — a classic
// cause of a single unexplained nightly drop.
const char *wifiReasonName(uint8_t r)
{
    switch (r) {
        case 1:   return "unspecified";
        case 2:   return "auth expired";
        case 4:   return "assoc expired (AP idle timeout)";
        case 8:   return "AP deauthenticated us";
        case 15:  return "4-way handshake timeout (group rekey)";
        case 200: return "beacon timeout (AP unreachable)";
        case 201: return "no AP found";
        case 202: return "auth failed";
        case 203: return "assoc failed";
        default:  return "";
    }
}

