exploded/ESP32-Rolloff/src/main.cpp
// Local wall-clock string, or an uptime fallback when NTP hadn't synced yet.
String diagWhen(const DiagEntry &e)
{
    if (e.epoch == 0) return "+" + String(e.uptimeSec) + "s (no clock)";
    time_t t = (time_t)e.epoch;
    struct tm tmv;
    localtime_r(&t, &tmv);
    char buf[24];
    strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &tmv);
    return String(buf);
}

// Diagnostics card for the info page — newest event first.
String diagCardHtml()
{
    String h = "<div class='card'><h2>Diagnostics</h2>"
               "<p><strong>Last reset:</strong> " + String(resetReasonName()) + "</p>"
               "<p><strong>Boots since power-on:</strong> " + String(s_diag.bootCount) + "</p>"
               "<p><strong>WiFi drops since power-on:</strong> " + String(s_diag.wifiDrops) + "</p>";

    time_t now = time(nullptr);
    h += "<p><strong>Clock:</strong> ";
    if (now > (time_t)TIME_SYNCED_EPOCH) {
        struct tm tmv;
        localtime_r(&now, &tmv);
        char buf[24];
        strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &tmv);
        h += buf;
    } else {
        h += "not synced";
    }
    h += "</p>";

    h += "<table><tr><th align='left'>When</th><th align='left'>Event</th></tr>";
    bool any = false;
    for (int i = 0; i < DIAG_EVENTS; i++) {
        // walk backwards from the most recently written slot
        int idx = (s_diag.head - 1 - i + 2 * DIAG_EVENTS) % DIAG_EVENTS;
        const DiagEntry &e = s_diag.ev[idx];
        if (e.type == EV_NONE) continue;
        any = true;
        String what = diagEventName(e.type);
        if (e.type == EV_WIFI_LOST) {
            what += " — reason " + String(e.detail);
            const char *rn = wifiReasonName(e.detail);
            if (rn[0]) what += " (" + String(rn) + ")";
        }
        h += "<tr><td><code>" + diagWhen(e) + "</code></td><td>" + what + "</td></tr>";
    }
    if (!any) h += "<tr><td colspan='2'>no events recorded</td></tr>";
    h += "</table></div>";
    return h;
}

// ── HTTP serving instrumentation ──────────────────────────────────────────────
// The failure being chased is TCP-level: requests never reach a handler at all.
// So the fingerprint is both servers' request counts going flat together while
// uptime and RSSI keep advancing.  Counters are RAM-only — the RTC log carries
// the events that need to survive a reboot.
uint32_t      s_infoRequests    = 0;
uint32_t      s_alpacaRequests  = 0;
unsigned long s_lastRequestMs   = 0;
uint32_t      s_recentRequests  = 0;   // completed 60 s window
uint32_t      s_windowCount     = 0;   // window in progress
unsigned long s_windowStartMs   = 0;
unsigned long s_lastHeartbeatMs = 0;
bool          s_stallLogged     = false;

void noteRequest(bool alpaca)
{
    if (alpaca) s_alpacaRequests++; else s_infoRequests++;
    s_lastRequestMs = millis();
    s_windowCount++;
    s_stallLogged   = false;   // re-arm the stall detector
}

// OLED burn-in state
unsigned long s_oledActivityMs = 0;    // last time something worth showing happened
unsigned long s_lastShiftMs    = 0;
uint8_t       s_oledShift      = 0;    // bit0 = y offset, bits1-2 = x offset
bool          s_oledBlanked    = false;

// Anything the operator would want to see on the panel calls this.
void oledWake()
{
    s_oledActivityMs = millis();
}

// ── Shutter logic ─────────────────────────────────────────────────────────────
// getShutterStatus() is a PURE read — it must never mutate motion state.  It is
// called from HTTP handlers, from updateOLED() and from loop(), and safeRestart()
// reads the same motion state to decide whether a reboot is safe.  When this
// function still mutated, a GET on /slewing could change whether the device was
// allowed to reboot.  All mutation now lives in updateMotionState(), called once
// per loop() so the state can't shift underneath a reader.
ShutterStatus getShutterStatus()
{
    bool closedActive = (digitalRead(LIMIT_SWITCH_CLOSED) == LOW);
    bool openActive   = (digitalRead(LIMIT_SWITCH_OPEN)   == LOW);

    if (closedActive && openActive) return SHUTTER_ERROR;
    if (closedActive)               return SHUTTER_CLOSED;
    if (openActive) {
        // Sitting on the open switch but commanded closed: still travelling.
        if (s_motionState == MOTION_CLOSING) return SHUTTER_CLOSING;
        return SHUTTER_OPEN;
    }

    if (s_motionState == MOTION_OPENING) return SHUTTER_OPENING;
    if (s_motionState == MOTION_CLOSING) return SHUTTER_CLOSING;
    if (s_motionState == MOTION_ERROR)   return SHUTTER_ERROR;
    if (s_lastCommand == LAST_CMD_OPEN)  return SHUTTER_OPENING;
    if (s_lastCommand == LAST_CMD_CLOSE) return SHUTTER_CLOSING;
    return SHUTTER_ERROR;
}

// The mutations that used to live inside getShutterStatus().  loop() only.
void updateMotionState()
{
    bool closedActive = (digitalRead(LIMIT_SWITCH_CLOSED) == LOW);
    bool openActive   = (digitalRead(LIMIT_SWITCH_OPEN)   == LOW);

    if (closedActive && openActive) {      // both switches — wiring or roof fault
        s_motionState = MOTION_ERROR;
        s_lastCommand = LAST_CMD_NONE;
        return;
    }
    if (closedActive) {
        s_motionState = MOTION_NONE;
        if (s_lastCommand == LAST_CMD_CLOSE) s_lastCommand = LAST_CMD_NONE;
        return;
    }
    if (openActive) {
        if (s_motionState == MOTION_CLOSING) return;   // leaving the open switch
        s_motionState = MOTION_NONE;
        if (s_lastCommand == LAST_CMD_OPEN) s_lastCommand = LAST_CMD_NONE;
    }
}

bool isSlewing()
{
    ShutterStatus s = getShutterStatus();
    return s == SHUTTER_OPENING || s == SHUTTER_CLOSING;
}

void triggerRelayPulse()
{
    digitalWrite(RELAY_PIN, HIGH);
    s_relayActive  = true;
    s_relayStartMs = millis();
    oledWake();
}

const char* shutterLabel(ShutterStatus s)
{
    switch (s) {
        case SHUTTER_OPEN:    return "OPEN";
        case SHUTTER_CLOSED:  return "CLOSED";
        case SHUTTER_OPENING: return "OPENING";
        case SHUTTER_CLOSING: return "CLOSING";
        default:              return "ERROR";
    }
}

