exploded/ESP32-Rolloff/src/main.cpp
// ── Roof commands ─────────────────────────────────────────────────────────────
// The single implementation behind both the Alpaca PUTs and the same-origin
// /cmd endpoint, so the browser path and the NINA path can never diverge.
// Returns false when the roof is already where it was asked to go.
bool commandOpen()
{
    if (getShutterStatus() == SHUTTER_OPEN) return false;
    s_lastCommand   = LAST_CMD_OPEN;
    s_motionState   = MOTION_OPENING;
    s_motionStartMs = millis();
    diagLog(EV_OPEN);
    triggerRelayPulse();
    return true;
}

bool commandClose()
{
    if (getShutterStatus() == SHUTTER_CLOSED) return false;
    s_lastCommand   = LAST_CMD_CLOSE;
    s_motionState   = MOTION_CLOSING;
    s_motionStartMs = millis();
    diagLog(EV_CLOSE);
    triggerRelayPulse();
    return true;
}

// The relay is a toggle, so only pulse when the roof is actually travelling —
// otherwise "abort" would start it.  Motion state is left for loop() to resolve
// so safeRestart()'s motion guard stays armed.
bool commandAbort()
{
    if (s_motionState != MOTION_OPENING && s_motionState != MOTION_CLOSING) {
        s_lastCommand = LAST_CMD_NONE;
        return false;
    }
    diagLog(EV_ABORT);
    triggerRelayPulse();
    s_lastCommand = LAST_CMD_NONE;
    return true;
}

// ── OLED ──────────────────────────────────────────────────────────────────────
// Layout (128x32 pixels, font size 1 = 6x8 px per character), all offset by
// (dx, dy) so the image drifts slightly over time:
//   y= 0: "Rolloff Roof"
//   y=11: status word inside an outlined box
//   y=23: IP address (or link-down countdown)
// The status box is an outline rather than a filled bar: the old
// fillRect(0,11,128,9) lit 1152 pixels continuously, which is both the main
// burn-in source and a heavy enough load to sag the charge pump.
void updateOLED()
{
    if (!s_oledOk) return;

    // Blank the panel once nothing has happened for a while.
    if (OLED_IDLE_BLANK_MS && (millis() - s_oledActivityMs) > OLED_IDLE_BLANK_MS) {
        if (!s_oledBlanked) {
            display.clearDisplay();
            display.display();
            display.ssd1306_command(SSD1306_DISPLAYOFF);
            s_oledBlanked = true;
        }
        return;
    }
    if (s_oledBlanked) {
        display.ssd1306_command(SSD1306_DISPLAYON);
        s_oledBlanked = false;
    }

    const int16_t dx = (s_oledShift >> 1) & 0x03;   // 0-3 px
    const int16_t dy =  s_oledShift       & 0x01;   // 0-1 px

    display.clearDisplay();
    display.setTextColor(SSD1306_WHITE);
    display.setTextSize(1);

    // Row 1 — title
    display.setCursor(dx, dy);
    display.print("Rolloff Roof");

    // Row 2 — status word in an outlined box
    ShutterStatus status = getShutterStatus();
    const char *label = shutterLabel(status);
    int16_t boxW = (int16_t)strlen(label) * 6 + 5;
    display.drawRect(dx, 11 + dy, boxW, 11, SSD1306_WHITE);
    display.setCursor(dx + 3, 13 + dy);
    display.print(label);

    // Row 3 — IP address, or how long the link has been down
    display.setCursor(dx, 23 + dy);
    if (WiFi.status() == WL_CONNECTED) {
        display.print(WiFi.localIP().toString());
    } else if (s_wifiDownSinceMs != 0) {
        display.printf("WiFi lost %lus", (millis() - s_wifiDownSinceMs) / 1000UL);
    } else {
        display.print("Connecting...");
    }

    display.display();
}

// ── Watchdog / recovery ───────────────────────────────────────────────────────
// Reboot, but never while the roof is physically moving — a reset floats the
// relay pin briefly, and we don't want to glitch the motor controller mid-travel.
// Returns having done nothing if motion is in progress; the caller retries.
void safeRestart(const char *reason)
{
    if (s_motionState == MOTION_OPENING || s_motionState == MOTION_CLOSING) {
        Serial.printf("Restart requested (%s) — deferred, roof is moving\n", reason);
        return;
    }

    Serial.printf("Restarting: %s\n", reason);
    diagLog(EV_REBOOT);
    if (s_oledOk) {
        display.clearDisplay();
        display.setTextSize(1);
        display.setTextColor(SSD1306_WHITE);
        display.setCursor(0, 0);
        display.print("Restarting");
        display.setCursor(0, 12);
        display.print(reason);
        display.display();
    }
    Serial.flush();
    delay(1000);
    ESP.restart();
}

// Polled from loop().  Escalates: notice the drop → re-associate → reboot.
void maintainWifi()
{
    // The driver knows about a drop long before a 5 s poll would notice.  Rather
    // than duplicate the recovery logic, just force the poll below to run now —
    // shrinking a ~10 s outage to ~2 s, which may be short enough that clients
    // like NINA never see a failed request.
    if (s_wifiEvtDisconnected || s_wifiEvtGotIp) {
        s_wifiEvtDisconnected = false;
        s_wifiEvtGotIp        = false;
        s_lastWifiCheckMs     = 0;   // millis() - 0 always exceeds the interval
    }

    if (millis() - s_lastWifiCheckMs < WIFI_CHECK_INTERVAL_MS) return;
    s_lastWifiCheckMs = millis();

    if (WiFi.status() == WL_CONNECTED) {
        if (s_wifiDownSinceMs != 0) {
            Serial.print("WiFi recovered, IP: ");
            Serial.println(WiFi.localIP());
            diagLog(EV_WIFI_OK);
            oledWake();
            startDiscovery();   // the UDP socket does not survive re-association
        }
        s_wifiDownSinceMs = 0;
        s_wifiRetries     = 0;
        return;
    }

    // First time we've seen the link down — kick off a reconnect immediately.
    if (s_wifiDownSinceMs == 0) {
        s_wifiDownSinceMs = millis();
        s_wifiRetries     = 0;
        s_wifiDropCount++;
        s_diag.wifiDrops++;
        uint8_t reason = s_wifiDisconnectReason;
        Serial.printf("WiFi link lost (reason %u %s) — reconnecting\n",
                      reason, wifiReasonName(reason));
        diagLog(EV_WIFI_LOST, reason);
        oledWake();   // a drop is worth lighting the panel for
        WiFi.disconnect();
        WiFi.begin(WIFI_SSID, WIFI_PASS);
        return;
    }

    // Give the current attempt its full grace period before doing anything else.
    if (millis() - s_wifiDownSinceMs < WIFI_RECONNECT_WAIT_MS) return;

