exploded/ESP32-Rolloff/src/main.cpp
    if (s_wifiRetries >= WIFI_MAX_RECONNECT_TRIES) {
        safeRestart("WiFi down");
        return;   // only returns here if the roof is moving — retry next poll
    }

    s_wifiRetries++;
    Serial.printf("WiFi reconnect attempt %u/%u\n", s_wifiRetries, WIFI_MAX_RECONNECT_TRIES);
    WiFi.disconnect();
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    s_wifiDownSinceMs = millis();
}

// ── Alpaca response helpers ───────────────────────────────────────────────────
void addCorsHeaders(WebServer &srv)
{
    srv.sendHeader("Access-Control-Allow-Origin",  "*");
    srv.sendHeader("Access-Control-Allow-Methods", "GET, PUT, OPTIONS");
    srv.sendHeader("Access-Control-Allow-Headers", "Content-Type");
}

void sendAlpacaRaw(WebServer &srv, const String &valueJson,
                   uint32_t clientTx, uint32_t errorNum, const String &errorMsg)
{
    uint32_t serverTx = s_serverTxId++;
    String resp =
        "{\"ClientTransactionID\":" + String(clientTx) +
        ",\"ServerTransactionID\":"  + String(serverTx) +
        ",\"ErrorNumber\":"          + String(errorNum) +
        ",\"ErrorMessage\":\""       + errorMsg + "\"," + valueJson + "}";
    addCorsHeaders(srv);
    srv.send(200, "application/json", resp);
}

void sendAlpacaBool(WebServer &srv, bool v, uint32_t clientTx)
{
    sendAlpacaRaw(srv, String("\"Value\":") + (v ? "true" : "false"), clientTx, 0, "");
}

void sendAlpacaInt(WebServer &srv, int v, uint32_t clientTx)
{
    sendAlpacaRaw(srv, "\"Value\":" + String(v), clientTx, 0, "");
}

void sendAlpacaString(WebServer &srv, const String &v, uint32_t clientTx)
{
    sendAlpacaRaw(srv, "\"Value\":\"" + v + "\"", clientTx, 0, "");
}

void sendAlpacaArray(WebServer &srv, const String &json, uint32_t clientTx)
{
    sendAlpacaRaw(srv, "\"Value\":" + json, clientTx, 0, "");
}

void sendAlpacaError(WebServer &srv, uint32_t clientTx, uint32_t errNum, const String &msg)
{
    sendAlpacaRaw(srv, "\"Value\":null", clientTx, errNum, msg);
}

uint32_t alpacaClientTx()
{
    String v = alpacaServer.arg("ClientTransactionID");
    return v.length() ? (uint32_t)v.toInt() : 0;
}

// ── Dome GET ──────────────────────────────────────────────────────────────────
void handleDomeGet()
{
    uint32_t clientTx = alpacaClientTx();
    String ep = alpacaServer.uri().substring(String("/api/v1/dome/0/").length());

    if (ep == "connected")        return sendAlpacaBool  (alpacaServer, s_alpacaConnected, clientTx);
    if (ep == "description")      return sendAlpacaString(alpacaServer, "Rolloff roof Alpaca dome driver", clientTx);
    if (ep == "driverinfo")       return sendAlpacaString(alpacaServer, "ESP32 Alpaca Dome Driver", clientTx);
    if (ep == "driverversion")    return sendAlpacaString(alpacaServer, "1.0", clientTx);
    if (ep == "interfaceversion") return sendAlpacaInt   (alpacaServer, 3, clientTx);
    if (ep == "name")             return sendAlpacaString(alpacaServer, "Rolloff Roof", clientTx);
    if (ep == "supportedactions") return sendAlpacaArray (alpacaServer, "[]", clientTx);

    if (ep == "cansetshutter")    return sendAlpacaBool(alpacaServer, true,  clientTx);
    if (ep == "canfindhome")      return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "canpark")          return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "cansetaltitude")   return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "cansetazimuth")    return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "cansetpark")       return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "canslave")         return sendAlpacaBool(alpacaServer, false, clientTx);
    if (ep == "cansyncazimuth")   return sendAlpacaBool(alpacaServer, false, clientTx);

    if (ep == "shutterstatus")    return sendAlpacaInt (alpacaServer, (int)getShutterStatus(), clientTx);
    if (ep == "slewing")          return sendAlpacaBool(alpacaServer, isSlewing(), clientTx);
    if (ep == "slaved")           return sendAlpacaBool(alpacaServer, false, clientTx);

    if (ep == "athome" || ep == "atpark")
        return sendAlpacaError(alpacaServer, clientTx, 0x400, "PropertyNotImplementedException");
    if (ep == "azimuth" || ep == "altitude")
        return sendAlpacaError(alpacaServer, clientTx, 0x400, "PropertyNotImplementedException");

    sendAlpacaError(alpacaServer, clientTx, 0x401, "InvalidValueException");
}

// ── Dome PUT ──────────────────────────────────────────────────────────────────
void handleDomePut()
{
    uint32_t clientTx = alpacaClientTx();
    String ep = alpacaServer.uri().substring(String("/api/v1/dome/0/").length());

    if (ep == "connected") {
        String val = alpacaServer.arg("Connected");
        if (val == "true"  || val == "True"  || val == "1") s_alpacaConnected = true;
        if (val == "false" || val == "False" || val == "0") s_alpacaConnected = false;
        return sendAlpacaBool(alpacaServer, s_alpacaConnected, clientTx);
    }
    if (ep == "openshutter") {
        commandOpen();
        return sendAlpacaRaw(alpacaServer, "\"Value\":null", clientTx, 0, "");
    }
    if (ep == "closeshutter") {
        commandClose();
        return sendAlpacaRaw(alpacaServer, "\"Value\":null", clientTx, 0, "");
    }
    if (ep == "abortslew") {
        commandAbort();
        return sendAlpacaRaw(alpacaServer, "\"Value\":null", clientTx, 0, "");
    }

    if (ep == "action"        || ep == "commandblind" ||
        ep == "commandbool"   || ep == "commandstring")
        return sendAlpacaError(alpacaServer, clientTx, 0x400, "MethodNotImplementedException");

    if (ep == "findhome"       || ep == "park"             || ep == "setpark"  ||
        ep == "slewtoaltitude" || ep == "slewtoazimuth"    || ep == "synctoazimuth" ||
        ep == "slaved")
        return sendAlpacaError(alpacaServer, clientTx, 0x400, "MethodNotImplementedException");

    sendAlpacaError(alpacaServer, clientTx, 0x401, "InvalidValueException");
}

// ── Management ────────────────────────────────────────────────────────────────
void handleManagement()
{
    noteRequest(true);
    uint32_t clientTx = alpacaClientTx();
    String path = alpacaServer.uri();

    if (path == "/management/apiversions")
        return sendAlpacaArray(alpacaServer, "[1]", clientTx);

