exploded/ESP32-Rolloff/src/main.cpp
    if (path == "/management/v1/description") {
        String desc =
            "{\"ServerName\":\"ESP32 Alpaca\",\"Manufacturer\":\"Rolloff\","
            "\"ManufacturerVersion\":\"1.0\",\"Location\":\"Observatory\"}";
        return sendAlpacaRaw(alpacaServer, "\"Value\":" + desc, clientTx, 0, "");
    }
    if (path == "/management/v1/configureddevices") {
        String devices =
            "[{\"DeviceType\":\"Dome\",\"DeviceName\":\"Rolloff Roof\","
            "\"DeviceNumber\":0,\"UniqueID\":\"ESP32-ROLLOFF-0\"}]";
        return sendAlpacaArray(alpacaServer, devices, clientTx);
    }

    addCorsHeaders(alpacaServer);
    alpacaServer.send(404, "text/plain", "Not found");
}

// ── Alpaca dome route handler (GET + PUT + OPTIONS) ──────────────────────────
// Registered explicitly for every /api/v1/dome/0/* path so WebServer always
// has a non-null _currentHandler and the "request handler not found" log_e
// warning is never triggered.
void handleDomeAny()
{
    noteRequest(true);
    HTTPMethod m = alpacaServer.method();
    if (m == HTTP_OPTIONS) { addCorsHeaders(alpacaServer); alpacaServer.send(200); return; }
    if (m == HTTP_GET)     { handleDomeGet(); return; }
    if (m == HTTP_PUT)     { handleDomePut(); return; }
    alpacaServer.send(405, "text/plain", "Method Not Allowed");
}

// ── Info page (port 80) ───────────────────────────────────────────────────────
// Served straight from flash: no String building, no per-request heap churn.
// The page polls /status.json instead of reloading itself, and its buttons hit
// /cmd on this same origin — so the browser never opens a connection to the
// Alpaca port and never issues a CORS preflight.  The previous version reloaded
// a ~4 kB page every 3 s, which on its own exceeded what the device can sustain:
// lwIP has 16 TCP PCBs and each served request holds one for ~140 s
// (FIN_WAIT_2 + TIME_WAIT), giving a budget of roughly 7 connections a minute.
static const char INDEX_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html><html><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Rolloff Roof</title><style>
body{font-family:Arial,Helvetica,sans-serif;margin:24px;background:#f5f5f5;color:#222}
h1{color:#333;font-size:1.5em}h2{font-size:1.1em;margin:0 0 8px}
.card{padding:16px;margin:12px 0;border-radius:8px;background:#fff;box-shadow:0 2px 6px rgba(0,0,0,.1)}
.btn{padding:10px 16px;margin-right:8px;border:none;border-radius:6px;cursor:pointer;font-size:1em}
.open{background:#28a745;color:#fff}.close{background:#dc3545;color:#fff}
.on{color:#dc3545;font-weight:bold}.off{color:#28a745}
#msg{margin-left:10px}
body.stale{opacity:.45}
p{margin:6px 0}
</style></head><body>
<h1>Rolloff Roof Controller</h1>
<div class="card"><h2>Status</h2>
<p><b>Shutter:</b> <span id="sh">&hellip;</span></p>
<p><b>Alpaca connected:</b> <span id="ac">&hellip;</span></p>
<p><b>Closed switch (GPIO 32):</b> <span id="cs">&hellip;</span></p>
<p><b>Open switch (GPIO 33):</b> <span id="os">&hellip;</span></p>
</div>
<div class="card"><h2>Controls</h2>
<button class="btn open" onclick="cmd('open')">Open Roof</button>
<button class="btn close" onclick="cmd('close')">Close Roof</button>
<span id="msg"></span>
</div>
<div class="card"><h2>Link</h2>
<p><b>Uptime:</b> <span id="up">&hellip;</span> min</p>
<p><b>WiFi RSSI:</b> <span id="rs">&hellip;</span> dBm</p>
<p><b>WiFi drops since boot:</b> <span id="wd">&hellip;</span></p>
<p><b>Requests (info/alpaca):</b> <span id="rq">&hellip;</span></p>
<p><b>Request rate:</b> <span id="rt">&hellip;</span> /min</p>
<p><b>Free heap:</b> <span id="hp">&hellip;</span> bytes</p>
<p><b>Largest free block:</b> <span id="mb">&hellip;</span> bytes</p>
<p><b>Listeners up:</b> <span id="ls">&hellip;</span></p>
</div>
<p><a href="/diag">Diagnostics &amp; event log</a></p>
<script>
function T(i,v){document.getElementById(i).textContent=v;}
function sw(i,a){var e=document.getElementById(i);e.textContent=a?"ACTIVE":"inactive";e.className=a?"on":"off";}
function upd(){
 fetch("/status.json",{cache:"no-store"}).then(function(r){return r.json();}).then(function(d){
  document.body.classList.remove("stale");
  T("sh",d.shutter);T("ac",d.connected?"Yes":"No");
  sw("cs",d.closedSw);sw("os",d.openSw);
  T("up",d.uptimeMin);T("rs",d.rssi);T("wd",d.drops);
  T("rq",d.reqInfo+" / "+d.reqAlpaca);T("rt",d.rate);
  T("hp",d.heap);T("mb",d.maxBlock);T("ls",d.listen?"yes":"NO");
 }).catch(function(){document.body.classList.add("stale");});
}
function cmd(a){
 T("msg","sending…");
 fetch("/cmd?a="+a,{cache:"no-store"}).then(function(r){return r.text();})
  .then(function(t){T("msg",t);setTimeout(upd,400);})
  .catch(function(e){T("msg","failed: "+e);});
}
upd();setInterval(upd,10000);
</script></body></html>
)rawliteral";

void handleInfoRoot()
{
    noteRequest(false);
    oledWake();   // someone is looking at the device
    infoServer.send_P(200, "text/html", INDEX_HTML);
}

// Small fixed-size JSON built with snprintf into a stack buffer — deliberately
// no String, so polling this costs no heap and cannot fragment it.
void handleStatusJson()
{
    noteRequest(false);

    char buf[400];
    snprintf(buf, sizeof(buf),
        "{\"shutter\":\"%s\",\"connected\":%s,\"closedSw\":%s,\"openSw\":%s,"
        "\"uptimeMin\":%lu,\"rssi\":%d,\"drops\":%lu,"
        "\"reqInfo\":%lu,\"reqAlpaca\":%lu,\"rate\":%lu,"
        "\"heap\":%lu,\"maxBlock\":%lu,\"listen\":%s}",
        shutterLabel(getShutterStatus()),
        s_alpacaConnected ? "true" : "false",
        (digitalRead(LIMIT_SWITCH_CLOSED) == LOW) ? "true" : "false",
        (digitalRead(LIMIT_SWITCH_OPEN)   == LOW) ? "true" : "false",
        millis() / 60000UL,
        (int)WiFi.RSSI(),
        (unsigned long)s_wifiDropCount,
        (unsigned long)s_infoRequests,
        (unsigned long)s_alpacaRequests,
        (unsigned long)s_recentRequests,
        (unsigned long)ESP.getFreeHeap(),
        (unsigned long)ESP.getMaxAllocHeap(),
        (infoServer.isListening() && alpacaServer.isListening()) ? "true" : "false");

    infoServer.send(200, "application/json", buf);
}

// Same-origin roof control.  Keeping this on port 80 means the browser makes no
// cross-origin request and so no OPTIONS preflight — halving what each click
// costs in connections.  CORS stays enabled on the Alpaca server for NINA and
// any other third-party client.
void handleCmd()
{
    noteRequest(false);
    oledWake();

