exploded/ESP32-Rolloff/src/main.cpp
    String a = infoServer.arg("a");
    const char *msg;

    if      (a == "open")  msg = commandOpen()  ? "opening"  : "already open";
    else if (a == "close") msg = commandClose() ? "closing"  : "already closed";
    else if (a == "abort") msg = commandAbort() ? "aborting" : "not moving";
    else {
        infoServer.send(400, "text/plain", "use ?a=open|close|abort");
        return;
    }
    infoServer.send(200, "text/plain", msg);
}

// Diagnostics live on their own page so the main page stays small and cheap.
// This one still builds a String, but it is only fetched when someone asks.
void handleDiagPage()
{
    noteRequest(false);

    String html =
        "<!DOCTYPE html><html><head><meta charset='utf-8'>"
        "<meta name='viewport' content='width=device-width,initial-scale=1'>"
        "<title>Rolloff Diagnostics</title><style>"
        "body{font-family:Arial,Helvetica,sans-serif;margin:24px;background:#f5f5f5;color:#222}"
        "h1{font-size:1.4em}h2{font-size:1.1em;margin:0 0 8px}"
        ".card{padding:16px;margin:12px 0;border-radius:8px;background:#fff;"
              "box-shadow:0 2px 6px rgba(0,0,0,.1)}"
        "table{border-collapse:collapse;width:100%}"
        "th,td{padding:4px 8px;border-bottom:1px solid #eee;font-size:.9em;text-align:left}"
        "p{margin:6px 0}"
        "</style></head><body><h1>Rolloff Roof Controller</h1>"
        + diagCardHtml() +
        "<div class='card'><h2>Alpaca</h2>"
        "<p>API base: <code>http://&lt;IP&gt;:" + String(ALPACA_HTTP_PORT) + "/api/v1/dome/0/</code></p>"
        "<p>Discovery UDP port: " + String(ALPACA_DISCOVERY_PORT) + "</p>"
        "<p>Lowest free heap since boot: " + String(ESP.getMinFreeHeap()) + " bytes</p>"
        "</div>"
        "<p><a href='/'>&larr; back</a></p></body></html>";

    infoServer.send(200, "text/html", html);
}

// ── Alpaca UDP discovery ──────────────────────────────────────────────────────
// Callback-driven rather than polled.  The old WiFiUDP version called
// parsePacket() on every loop() iteration, and that does a malloc(1460) + free()
// each time — by far the largest source of allocator churn in this firmware, and
// the most likely cause of any heap fragmentation.  The callback runs in the
// lwIP task but touches nothing loop() owns, so there is no race.
// The socket does not survive a re-association, so this is re-armed from
// maintainWifi() whenever the link comes back.
void startDiscovery()
{
    udpDiscovery.close();
    if (!udpDiscovery.listen(ALPACA_DISCOVERY_PORT)) {
        Serial.println("Alpaca discovery: listen FAILED");
        return;
    }
    udpDiscovery.onPacket([](AsyncUDPPacket packet) {
        if (packet.length() < 16) return;
        if (strncmp((const char *)packet.data(), "alpacadiscovery1", 16) != 0) return;
        // The reply must carry ONLY AlpacaPort.  The RG-11 safety monitor
        // records that adding a Devices array makes NINA silently drop the
        // device — do not "improve" this payload.
        char resp[40];
        snprintf(resp, sizeof(resp), "{\"AlpacaPort\":%d}", ALPACA_HTTP_PORT);
        packet.print(resp);
    });
}

// ── setup() ───────────────────────────────────────────────────────────────────
void setup()
{
    Serial.begin(115200);
    Serial.println("\n\nESP32 Rolloff Alpaca Driver starting...");

    // Diagnostics record — RTC memory is garbage after a power cycle, so gate on
    // both the magic and the reset reason before trusting it.
    esp_reset_reason_t rr = esp_reset_reason();
    if (s_diag.magic != DIAG_MAGIC || rr == ESP_RST_POWERON) {
        memset(&s_diag, 0, sizeof(s_diag));
        s_diag.magic = DIAG_MAGIC;
    }
    s_diag.bootCount++;
    Serial.printf("Reset reason: %s (boot #%lu)\n", resetReasonName(),
                  (unsigned long)s_diag.bootCount);

    // GPIO
    pinMode(LIMIT_SWITCH_CLOSED, INPUT_PULLUP);
    pinMode(LIMIT_SWITCH_OPEN,   INPUT_PULLUP);
    pinMode(RELAY_PIN, OUTPUT);
    digitalWrite(RELAY_PIN, LOW);   // relay off at boot

    Serial.printf("Limit switches: GPIO%d (closed), GPIO%d (open)\n",
                  LIMIT_SWITCH_CLOSED, LIMIT_SWITCH_OPEN);
    Serial.printf("Relay: GPIO%d\n", RELAY_PIN);

    // OLED (I2C on GPIO19=SCL, GPIO21=SDA)
    Wire.begin(OLED_SDA, OLED_SCL);
    // 400 kHz: pushing the 512-byte framebuffer at the 100 kHz default blocks
    // loop() for ~46 ms every 500 ms — ~9 % of the time accepting no
    // connections.  The SSD1306 is rated for fast-mode I2C.
    Wire.setClock(400000);

    // Scan I2C bus to find the OLED address.
    // Note: Adafruit SSD1306 begin() returns true even when no device is present
    // (it only checks RAM allocation), so we use the scan as the real indicator.
    Serial.print("I2C scan: ");
    uint8_t oledAddr = 0;
    for (uint8_t addr = 1; addr < 127; addr++) {
        Wire.beginTransmission(addr);
        if (Wire.endTransmission() == 0) {
            Serial.printf("0x%02X ", addr);
            if ((addr == 0x3C || addr == 0x3D) && oledAddr == 0) oledAddr = addr;
        }
    }
    Serial.println(oledAddr ? "" : "no devices found — check SDA→D21 SCL→D19 wiring");

    // Only initialise the display if a known SSD1306 address was actually found
    if (oledAddr) {
        s_oledOk = display.begin(SSD1306_SWITCHCAPVCC, oledAddr);
    }
    if (s_oledOk) {
        // Turn the drive current down before anything is shown — the library
        // default (0xCF) is needlessly bright and accelerates burn-in.
        display.ssd1306_command(SSD1306_SETCONTRAST);
        display.ssd1306_command(OLED_CONTRAST);

        display.clearDisplay();
        display.setTextSize(1);
        display.setTextColor(SSD1306_WHITE);
        display.setCursor(0, 0);
        display.print("Rolloff Roof");
        display.setCursor(0, 12);
        display.print("Connecting...");
        display.display();
        Serial.println("OLED OK");
    } else {
        Serial.println("OLED init failed - continuing without display");
    }

    // WiFi — re-begin at 15 s, restart at 30 s
    WiFi.persistent(false);        // don't wear out flash rewriting the same creds
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);          // modem sleep makes the link flaky under polling
    WiFi.setAutoReconnect(true);   // first line of defence; maintainWifi() backs it up
    WiFi.setHostname("rolloff");
    WiFi.onEvent(onWiFiEvent);     // must be registered before begin()
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    Serial.print("Connecting to WiFi");
    {
        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED) {
            delay(500);
            Serial.print(".");
            ++attempts;

            // Half way — tear the association down and start over.  Cheaper than
            // a reboot and clears a stuck WPA handshake.
            if (attempts == BOOT_WIFI_REBEGIN_TRIES) {
                Serial.print(" retrying");
                WiFi.disconnect(true);
                delay(200);
                WiFi.mode(WIFI_STA);
                WiFi.begin(WIFI_SSID, WIFI_PASS);
            }

