exploded/ESP32-Rolloff/src/main.cpp
            if (attempts >= BOOT_WIFI_MAX_TRIES) {
                Serial.println("\nWiFi failed — restarting in 3 s");
                if (s_oledOk) {
                    display.clearDisplay();
                    display.setTextSize(1);
                    display.setTextColor(SSD1306_WHITE);
                    display.setCursor(0, 0);
                    display.print("WiFi failed!");
                    display.setCursor(0, 12);
                    display.print(WIFI_SSID);
                    display.setCursor(0, 24);
                    display.print("Restarting...");
                    display.display();
                }
                delay(3000);
                ESP.restart();
            }
        }
    }
    Serial.println();
    Serial.print("Connected!  IP: ");
    Serial.println(WiFi.localIP());

    // NTP — non-blocking, syncs in the background.  Only needed so the event log
    // carries wall-clock times that line up with NINA's log.
    configTzTime(TZ_INFO, NTP_SERVER_1, NTP_SERVER_2);
    diagLog(EV_BOOT);

    // Info server — port 80
    infoServer.on("/",            HTTP_GET, handleInfoRoot);
    infoServer.on("/status.json", HTTP_GET, handleStatusJson);
    infoServer.on("/cmd",         HTTP_GET, handleCmd);
    infoServer.on("/diag",        HTTP_GET, handleDiagPage);
    infoServer.on("/favicon.ico", HTTP_GET, []() { infoServer.send(204); });
    infoServer.onNotFound([]() { infoServer.send(404, "text/plain", "Not found"); });
    infoServer.begin();
    if (!infoServer.isListening()) Serial.println("WARNING: info server failed to listen");
    Serial.printf("Info server on port %d\n", INFO_PORT);

    // Alpaca server — port 11111
    // Register every known endpoint explicitly so WebServer's _currentHandler is
    // always non-null.  onNotFound is only reached for genuinely unknown paths.
    static const char* domeEps[] = {
        "/api/v1/dome/0/connected",        "/api/v1/dome/0/description",
        "/api/v1/dome/0/driverinfo",       "/api/v1/dome/0/driverversion",
        "/api/v1/dome/0/interfaceversion", "/api/v1/dome/0/name",
        "/api/v1/dome/0/supportedactions", "/api/v1/dome/0/cansetshutter",
        "/api/v1/dome/0/canfindhome",      "/api/v1/dome/0/canpark",
        "/api/v1/dome/0/cansetaltitude",   "/api/v1/dome/0/cansetazimuth",
        "/api/v1/dome/0/cansetpark",       "/api/v1/dome/0/canslave",
        "/api/v1/dome/0/cansyncazimuth",   "/api/v1/dome/0/shutterstatus",
        "/api/v1/dome/0/slewing",          "/api/v1/dome/0/slaved",
        "/api/v1/dome/0/athome",           "/api/v1/dome/0/atpark",
        "/api/v1/dome/0/azimuth",          "/api/v1/dome/0/altitude",
        "/api/v1/dome/0/openshutter",      "/api/v1/dome/0/closeshutter",
        "/api/v1/dome/0/abortslew",        "/api/v1/dome/0/action",
        "/api/v1/dome/0/commandblind",     "/api/v1/dome/0/commandbool",
        "/api/v1/dome/0/commandstring",    "/api/v1/dome/0/findhome",
        "/api/v1/dome/0/park",             "/api/v1/dome/0/setpark",
        "/api/v1/dome/0/slewtoaltitude",   "/api/v1/dome/0/slewtoazimuth",
        "/api/v1/dome/0/synctoazimuth",    nullptr
    };
    for (int i = 0; domeEps[i]; i++) {
        alpacaServer.on(domeEps[i], HTTP_ANY, handleDomeAny);
    }
    alpacaServer.on("/management/apiversions",          HTTP_ANY, handleManagement);
    alpacaServer.on("/management/v1/description",       HTTP_ANY, handleManagement);
    alpacaServer.on("/management/v1/configureddevices", HTTP_ANY, handleManagement);
    alpacaServer.on("/setup/v1/dome/0/setup", HTTP_ANY, []() {
        addCorsHeaders(alpacaServer);
        alpacaServer.send(200, "text/html",
            "<html><body><h1>Alpaca Setup</h1>"
            "<p>This device uses fixed configuration in firmware.</p>"
            "</body></html>");
    });
    alpacaServer.on("/favicon.ico", HTTP_ANY, []() { alpacaServer.send(204); });
    alpacaServer.onNotFound([]() {
        addCorsHeaders(alpacaServer);
        alpacaServer.send(404, "text/plain", "Not found");
    });
    alpacaServer.begin();
    if (!alpacaServer.isListening()) Serial.println("WARNING: alpaca server failed to listen");
    Serial.printf("Alpaca server on port %d\n", ALPACA_HTTP_PORT);

    // Alpaca UDP discovery
    startDiscovery();
    Serial.printf("Alpaca discovery on UDP port %d\n", ALPACA_DISCOVERY_PORT);

    // Hardware task watchdog — armed last so a slow setup() can't trip it.
    // If loop() stops feeding it for WDT_TIMEOUT_S the chip resets.
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_config_t wdtCfg = {
        .timeout_ms     = WDT_TIMEOUT_S * 1000,
        .idle_core_mask = 0,
        .trigger_panic  = true
    };
    // Core 3.x may already have initialised the TWDT — reconfigure in that case.
    if (esp_task_wdt_init(&wdtCfg) == ESP_ERR_INVALID_STATE) {
        esp_task_wdt_reconfigure(&wdtCfg);
    }
#else
    esp_task_wdt_init(WDT_TIMEOUT_S, true);
#endif
    esp_task_wdt_add(NULL);   // watch the Arduino loop task
    Serial.printf("Task watchdog armed (%d s)\n", WDT_TIMEOUT_S);

    oledWake();
    updateOLED();
}

// ── loop() ────────────────────────────────────────────────────────────────────
void loop()
{
    esp_task_wdt_reset();   // feed the hardware watchdog

    // Non-blocking relay pulse — turn off after RELAY_PULSE_MS
    if (s_relayActive && (millis() - s_relayStartMs >= RELAY_PULSE_MS)) {
        digitalWrite(RELAY_PIN, LOW);
        s_relayActive = false;
    }

    // Sole owner of motion state — everything else only reads it
    updateMotionState();

    // Movement timeout watchdog
    if ((s_motionState == MOTION_OPENING || s_motionState == MOTION_CLOSING) &&
        s_motionStartMs != 0 &&
        (millis() - s_motionStartMs) > MOVEMENT_TIMEOUT_MS) {
        s_motionState = MOTION_ERROR;
    }

    maintainWifi();

    infoServer.handleClient();
    alpacaServer.handleClient();
    // discovery is callback-driven now — nothing to poll here

    // Roll the request-rate window
    if (millis() - s_windowStartMs >= REQ_WINDOW_MS) {
        s_recentRequests = s_windowCount;
        s_windowCount    = 0;
        s_windowStartMs  = millis();
    }

    // Log-only stall detector.  Deliberately takes no action: a quiet device is
    // indistinguishable from a wedged one without a client to compare against,
    // and a roof controller that reboots itself on a guess is worse than one
    // that is briefly unreachable.  Edge-triggered so a quiet day logs once.
    if (!s_stallLogged && s_lastRequestMs != 0 &&
        (millis() - s_lastRequestMs) > NET_STALL_MS) {
        s_stallLogged = true;
        diagLog(EV_NET_STALL, (uint8_t)((millis() - s_lastRequestMs) / 60000UL));
        Serial.printf("No HTTP requests for %lu min (listening: info=%d alpaca=%d)\n",
                      (millis() - s_lastRequestMs) / 60000UL,
                      infoServer.isListening(), alpacaServer.isListening());
    }

    // Serial heartbeat — the fingerprint of the fault is both request counts
    // going flat together while uptime and RSSI keep advancing.
    if (millis() - s_lastHeartbeatMs >= HEARTBEAT_MS) {
        s_lastHeartbeatMs = millis();
        Serial.printf("up=%lumin rssi=%d req(info/alpaca)=%lu/%lu rate=%lu/min "
                      "listen=%d/%d heap=%u maxblk=%u minfree=%u\n",
                      millis() / 60000UL, WiFi.RSSI(),
                      (unsigned long)s_infoRequests, (unsigned long)s_alpacaRequests,
                      (unsigned long)s_recentRequests,
                      infoServer.isListening(), alpacaServer.isListening(),
                      ESP.getFreeHeap(), ESP.getMaxAllocHeap(), ESP.getMinFreeHeap());
    }

    // Wake the panel whenever the roof actually changes state
    {
        static ShutterStatus lastShutter = SHUTTER_ERROR;
        static bool          haveLast    = false;
        ShutterStatus now = getShutterStatus();
        if (!haveLast || now != lastShutter) {
            if (haveLast) oledWake();
            lastShutter = now;
            haveLast    = true;
        }
    }

    // Drift the layout a few pixels so nothing stays lit forever
    if (millis() - s_lastShiftMs >= OLED_SHIFT_INTERVAL_MS) {
        s_oledShift  = (s_oledShift + 1) & 0x07;
        s_lastShiftMs = millis();
    }

    // Refresh OLED every 500 ms
    if (millis() - s_lastOledMs >= OLED_REFRESH_MS) {
        updateOLED();
        s_lastOledMs = millis();
    }
}
